org/cpp/cppconcurrency.org
#+TITLE: C++ Concurrency
#+KEYWORDS: c++
#+OPTIONS: H:3 toc:2 num:3 ^:nil
#+LANGUAGE: en-US
#+AUTHOR: ChrisChen
#+EMAIL: ChrisChen3121@gmail.com
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+SETUPFILE: ../../org-templates/level-1.org
* Overview
** Purpose
*** Separation of concerns
*** Performance
    - Task parallelism
    - Data parallelism: Each thread performs the same operation on different parts of the data.
* Managing threads
** Daemon Threads
    #+BEGIN_SRC cpp
      std::thread t(do_background_work);
      t.detach();
    #+END_SRC

** Passing Arguments
   The arguments are *copied* into thread's internal storage by default. Use /std::ref/ to bind a reference argument.
   #+BEGIN_SRC cpp
     std::thread t(update_ref_data, std::ref(data)); // use std::move for move scenario
   #+END_SRC

** RAII(Resource Acquisition Is Initialization)
   Use RAII to avoid use of /try/catch/ blocks. Instances of std::thread are *movable*, but aren't *copyable*
   #+BEGIN_SRC cpp
     class ScopedThread {
     public:
       explicit ScopedThread(std::thread t) : t_(std::move(t)) {
         if (!t_.joinable())
           throw std::logic_error("No thread");
       }
       ~ScopedThread() { t_.join(); }
       ScopedThread(const ScopedThread &) = delete;
       ScopedThread &operator=(const ScopedThread &) = delete;

     private:
       std::thread t_;
     };

     ScopedThread t(std::thread(some_func));
   #+END_SRC

** hardware_concurrency
   #+BEGIN_SRC cpp
     std::cout << std::thread::hardware_concurrency() << "\n";
   #+END_SRC
* Sharing data
** Avoiding Deadlock
*** *std::lock*
    A function that can lock two or more mutexes at once without risk of deadlock
    #+BEGIN_SRC cpp
      std::lock(mu1, mu2);
      std::lock_guard<std::mutex> lock_a(mu1, std::adopt_lock);
      std::lock_guard<std::mutex> lock_b(mu2, std::adopt_lock);
    #+END_SRC
** Lazy Initialization
*** std::once_flag & std::call_once
     #+BEGIN_SRC cpp
       std::shared_ptr<some_resource> resource_ptr;

       void init_resource() {
         resource_ptr.reset(new some_resource);
       }

       void foo() {
         static std::once_flag resource_flag;
         std::call_once(resource_flag, init_resource());
         resource_ptr->do_something();
       }
     #+END_SRC

*** static(C++11)
    #+BEGIN_SRC cpp
      SomeClass &get_instance() {
        static SomeClass instance;
        return instance;
      }
    #+END_SRC

** Reader-writer Mutex
   - boost::shared_mutex
   - readers: shared_lock
   - writers: unique_lock

** More Approach
*** software transactional memory(STM)
    like transaction in database, this is an active research area.

* Paradigm
  - FP style

    Use future can be passed around between threads to allow the result of one computation to depend on the result of another, without any explicit access to shared data.

  - CSP(Communicating Sequential Processes)

    See atm example

* Synchronizing Concurrent Operations
