cpp/cppconcurrency.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en-US" xml:lang="en-US">
<head>
<!-- 2020-06-09 Tue 16:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++ Concurrency</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="c++" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">C++ Concurrency</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1ffd705">1. Overview</a>
<ul>
<li><a href="#orgbf16cf2">1.1. Purpose</a></li>
</ul>
</li>
<li><a href="#orgedc2072">2. Managing threads</a>
<ul>
<li><a href="#org6784454">2.1. Daemon Threads</a></li>
<li><a href="#orgd914d2c">2.2. Passing Arguments</a></li>
<li><a href="#orgc5f8856">2.3. RAII(Resource Acquisition Is Initialization)</a></li>
<li><a href="#org7d27c80">2.4. hardware_concurrency</a></li>
</ul>
</li>
<li><a href="#org74829c6">3. Sharing data</a>
<ul>
<li><a href="#orgf81c3ad">3.1. Avoiding Deadlock</a></li>
<li><a href="#org044a4b2">3.2. Lazy Initialization</a></li>
<li><a href="#orga60eac2">3.3. Reader-writer Mutex</a></li>
<li><a href="#org8cba50f">3.4. More Approach</a></li>
</ul>
</li>
<li><a href="#org38bb2b3">4. Paradigm</a></li>
<li><a href="#orgfcd4fd0">5. Synchronizing Concurrent Operations</a>
<ul>
<li><a href="#org9029afc">5.1. Condition Variables</a></li>
<li><a href="#orgb8e3fbc">5.2. std::future&lt;&gt; &amp; std::async</a></li>
<li><a href="#orgf28beeb">5.3. std::packaged_task&lt;&gt;</a></li>
<li><a href="#org60f8e61">5.4. std::promise&lt;&gt;</a></li>
</ul>
</li>
<li><a href="#orge213ffc">6. Memory Model</a>
<ul>
<li><a href="#orgcc0a6d4">6.1. Modification Orders</a></li>
<li><a href="#org6ffc5f5">6.2. Atomic Types</a></li>
</ul>
</li>
<li><a href="#orga7cd378">7. Useful tools</a>
<ul>
<li><a href="#org6c7f473">7.1. std::mem_fn</a></li>
<li><a href="#orgaaf0322">7.2. Time Facilities</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1ffd705" class="outline-2">
<h2 id="org1ffd705"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbf16cf2" class="outline-3">
<h3 id="orgbf16cf2"><span class="section-number-3">1.1</span> Purpose</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org5527159" class="outline-4">
<h4 id="org5527159"><span class="section-number-4">1.1.1</span> Separation of concerns</h4>
</div>
<div id="outline-container-orge0d792f" class="outline-4">
<h4 id="orge0d792f"><span class="section-number-4">1.1.2</span> Performance</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Task parallelism</li>
<li>Data parallelism: Each thread performs the same operation on different parts of the data.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgedc2072" class="outline-2">
<h2 id="orgedc2072"><span class="section-number-2">2</span> Managing threads</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6784454" class="outline-3">
<h3 id="org6784454"><span class="section-number-3">2.1</span> Daemon Threads</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">thread</span> <span style="color: #6c3163; font-weight: bold;">t</span>(do_background_work);
t.detach();
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd914d2c" class="outline-3">
<h3 id="orgd914d2c"><span class="section-number-3">2.2</span> Passing Arguments</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The arguments are <b>copied</b> into thread's internal storage by default. Use <i>std::ref</i> to bind a reference argument.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">thread</span> <span style="color: #6c3163; font-weight: bold;">t</span>(update_ref_data, <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">ref</span>(<span style="color: #715ab1;">data</span>)); <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">use std::move for move scenar</span><span style="color: #6c4173; background-color: #ecf3ec;">io</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5f8856" class="outline-3">
<h3 id="orgc5f8856"><span class="section-number-3">2.3</span> RAII(Resource Acquisition Is Initialization)</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Use RAII to avoid use of <i>try/catch</i> blocks. Instances of std::thread are <b>movable</b>, but aren't <b>copyable</b>
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">ScopedThread</span> {
<span style="color: #3a81c3; font-weight: bold;">public</span>:
  <span style="color: #3a81c3; font-weight: bold;">explicit</span> <span style="color: #6c3163; font-weight: bold;">ScopedThread</span>(<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">thread</span> <span style="color: #715ab1;">t</span>) : t_(<span style="color: #4e3163;">std</span>::move(t)) {
    <span style="color: #3a81c3; font-weight: bold;">if</span> (<span style="color: #4e3163;">!</span>t_.joinable())
      <span style="color: #3a81c3; font-weight: bold;">throw</span> <span style="color: #4e3163;">std</span>::logic_error(<span style="color: #2d9574;">"No thread"</span>);
  }
  ~<span style="color: #6c3163; font-weight: bold;">ScopedThread</span>() { t_.join(); }
  <span style="color: #6c3163; font-weight: bold;">ScopedThread</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">ScopedThread</span> &amp;) = <span style="color: #3a81c3; font-weight: bold;">delete</span>;
  <span style="color: #ba2f59; font-weight: bold;">ScopedThread</span> &amp;<span style="color: #3a81c3; font-weight: bold;">operator</span><span style="color: #6c3163; font-weight: bold;">=</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">ScopedThread</span> &amp;) = <span style="color: #3a81c3; font-weight: bold;">delete</span>;

<span style="color: #3a81c3; font-weight: bold;">private</span>:
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">thread</span> <span style="color: #715ab1;">t_</span>;
};

<span style="color: #ba2f59; font-weight: bold;">ScopedThread</span> <span style="color: #6c3163; font-weight: bold;">t</span>(<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">thread</span>(<span style="color: #715ab1;">some_func</span>));
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d27c80" class="outline-3">
<h3 id="org7d27c80"><span class="section-number-3">2.4</span> hardware_concurrency</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::cout &lt;&lt; <span style="color: #4e3163;">std</span>::<span style="color: #4e3163;">thread</span>::hardware_concurrency() &lt;&lt; <span style="color: #2d9574;">"\n"</span>;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org74829c6" class="outline-2">
<h2 id="org74829c6"><span class="section-number-2">3</span> Sharing data</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf81c3ad" class="outline-3">
<h3 id="orgf81c3ad"><span class="section-number-3">3.1</span> Avoiding Deadlock</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org9fce963" class="outline-4">
<h4 id="org9fce963"><span class="section-number-4">3.1.1</span> <b>std::lock</b></h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
A function that can lock two or more mutexes at once without risk of deadlock
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::lock(mu1, mu2);
<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">lock_guard</span>&lt;<span style="color: #4e3163;">std</span>::mutex&gt; <span style="color: #6c3163; font-weight: bold;">lock_a</span>(mu1, <span style="color: #4e3163;">std</span>::adopt_lock);
<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">lock_guard</span>&lt;<span style="color: #4e3163;">std</span>::mutex&gt; <span style="color: #6c3163; font-weight: bold;">lock_b</span>(mu2, <span style="color: #4e3163;">std</span>::adopt_lock);
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org044a4b2" class="outline-3">
<h3 id="org044a4b2"><span class="section-number-3">3.2</span> Lazy Initialization</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgae253a4" class="outline-4">
<h4 id="orgae253a4"><span class="section-number-4">3.2.1</span> std::once_flag &amp; std::call_once</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">shared_ptr</span>&lt;some_resource&gt; <span style="color: #715ab1;">resource_ptr</span>;

<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">init_resource</span>() {
  resource_ptr.reset(<span style="color: #3a81c3; font-weight: bold;">new</span> <span style="color: #ba2f59; font-weight: bold;">some_resource</span>);
}

<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">foo</span>() {
  <span style="color: #3a81c3; font-weight: bold;">static</span> <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">once_flag</span> <span style="color: #715ab1;">resource_flag</span>;
  <span style="color: #4e3163;">std</span>::call_once(resource_flag, init_resource());
  resource_ptr-&gt;do_something();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb4ad74" class="outline-4">
<h4 id="orgbb4ad74"><span class="section-number-4">3.2.2</span> static(C++11)</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">SomeClass</span> &amp;<span style="color: #6c3163; font-weight: bold;">get_instance</span>() {
  <span style="color: #3a81c3; font-weight: bold;">static</span> <span style="color: #ba2f59; font-weight: bold;">SomeClass</span> <span style="color: #715ab1;">instance</span>;
  <span style="color: #3a81c3; font-weight: bold;">return</span> instance;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga60eac2" class="outline-3">
<h3 id="orga60eac2"><span class="section-number-3">3.3</span> Reader-writer Mutex</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>boost::shared_mutex</li>
<li>readers: shared_lock</li>
<li>writers: unique_lock</li>
</ul>
</div>
</div>

<div id="outline-container-org8cba50f" class="outline-3">
<h3 id="org8cba50f"><span class="section-number-3">3.4</span> More Approach</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org9355546" class="outline-4">
<h4 id="org9355546"><span class="section-number-4">3.4.1</span> software transactional memory(STM)</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
like transaction in database, this is an active research area.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org38bb2b3" class="outline-2">
<h2 id="org38bb2b3"><span class="section-number-2">4</span> Paradigm</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><p>
FP style
</p>

<p>
Use future can be passed around between threads to allow the result of one computation to depend on the result of another, without any explicit access to shared data.
</p></li>

<li><p>
CSP(Communicating Sequential Processes)
</p>

<p>
See atm example
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orgfcd4fd0" class="outline-2">
<h2 id="orgfcd4fd0"><span class="section-number-2">5</span> Synchronizing Concurrent Operations</h2>
<div class="outline-text-2" id="text-5">
</div>
