org/cpp/cppconcurrency.org
** Condition Variables
   - example: Thread-safe Queue
   #+BEGIN_SRC cpp
      template <typename T> class threadsafe_queue {
      public:
        threadsafe_queue() {}
        threadsafe_queue(const threadsafe_queue &other) {
          std::lock_guard<std::mutex> lk(other.mu_);
          data_queue_ = other.data_queue_;
        }

        bool empty() const {
          std::lock_guard<std::mutex> lk(mu_);
          return data_queue_.empty();
        }

        void push(T new_value) {
          std::lock_guard<std::mutex> lk(mu_);
          data_queue_.push(new_value);
          data_cond_.notify_one(); // notify_all
        }
        void wait_and_pop(T &value) {
          std::unique_lock<std::mutex> lk(mu_);
          data_cond_.wait(lk, [this] { !data_queue_.empty(); }); // unlock->wait->lock
          value = data_queue.front();
          data_queue.pop();
        }

      private:
        mutable std::mutex mu_; // const member func like empty can lock mu_
        std::queue<T> data_queue_;
        std::condition_variable data_cond_;
      };
   #+END_SRC
** std::future<> & std::async
   only moveable, wrapped by unique_ptr
   #+BEGIN_SRC cpp
     std::future<data> result = std::async(find_the_answer);
     do_other_things();
     std::cout << result.get() << "\n";
   #+END_SRC
   options: std::launch::async, std::launch::deferred

*** std::shared_future
    copyable, wrapped by shared_ptr
    - operations on copied shared_future are thread-safe
    - std::future -> std::shared_future
    - access to the same shared state from multiple threads is safe if each thread does it through its own *copy* of a ~shared_future~ object.

** std::packaged_task<>
   std::packaged_task<> ties a future to a function or callable object.
   #+BEGIN_SRC cpp
     std::packaged_task<int(int, int)> some_task(task_func);
     auto result = some_task.get_future();
     std::thread t{std::move(some_task), a, b};
     result.get();
     t.join();
   #+END_SRC

*** when to use
    - used as a building block for thread pools
    - task management schemes

*** specialization of std::packaged_task<>
   #+BEGIN_SRC cpp
     template <> class packaged_task<std::string(std::vector<char> *, int)> {
     public:
       template <typename Callable> explicit packaged_task(Callable &&f);
       std::future<std::string> get_future();
       void operator()(std::vector<char> *, int);
     };
   #+END_SRC

