cpp/cppconcurrency.html
<div id="outline-container-org9029afc" class="outline-3">
<h3 id="org9029afc"><span class="section-number-3">5.1</span> Condition Variables</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>example: Thread-safe Queue</li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span> &lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">T</span>&gt; <span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">threadsafe_queue</span> {
<span style="color: #3a81c3; font-weight: bold;">public</span>:
  <span style="color: #6c3163; font-weight: bold;">threadsafe_queue</span>() {}
  <span style="color: #6c3163; font-weight: bold;">threadsafe_queue</span>(<span style="color: #3a81c3; font-weight: bold;">const</span> <span style="color: #ba2f59; font-weight: bold;">threadsafe_queue</span> &amp;<span style="color: #715ab1;">other</span>) {
    <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">lock_guard</span>&lt;<span style="color: #4e3163;">std</span>::mutex&gt; <span style="color: #715ab1;">lk</span>(other.mu_);
    data_queue_ = other.data_queue_;
  }

  <span style="color: #ba2f59; font-weight: bold;">bool</span> <span style="color: #6c3163; font-weight: bold;">empty</span>() <span style="color: #3a81c3; font-weight: bold;">const</span> {
    <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">lock_guard</span>&lt;<span style="color: #4e3163;">std</span>::mutex&gt; <span style="color: #715ab1;">lk</span>(mu_);
    <span style="color: #3a81c3; font-weight: bold;">return</span> data_queue_.empty();
  }

  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">push</span>(<span style="color: #ba2f59; font-weight: bold;">T</span> <span style="color: #715ab1;">new_value</span>) {
    <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">lock_guard</span>&lt;<span style="color: #4e3163;">std</span>::mutex&gt; <span style="color: #715ab1;">lk</span>(mu_);
    data_queue_.push(new_value);
    data_cond_.notify_one(); <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">notify_all</span>
  }
  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">wait_and_pop</span>(<span style="color: #ba2f59; font-weight: bold;">T</span> &amp;<span style="color: #715ab1;">value</span>) {
    <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">unique_lock</span>&lt;<span style="color: #4e3163;">std</span>::mutex&gt; <span style="color: #715ab1;">lk</span>(mu_);
    data_cond_.wait(lk, [<span style="color: #3a81c3; font-weight: bold;">this</span>] { <span style="color: #4e3163;">!</span>data_queue_.empty(); }); <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">unlock-&gt;wait-&gt;lock</span>
    value = data_queue.front();
    data_queue.pop();
  }

<span style="color: #3a81c3; font-weight: bold;">private</span>:
  <span style="color: #3a81c3; font-weight: bold;">mutable</span> <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">mutex</span> <span style="color: #715ab1;">mu_</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">const member func like empty can lock mu_</span>
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">queue</span>&lt;<span style="color: #ba2f59; font-weight: bold;">T</span>&gt; <span style="color: #715ab1;">data_queue_</span>;
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">condition_variable</span> <span style="color: #715ab1;">data_cond_</span>;
};
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb8e3fbc" class="outline-3">
<h3 id="orgb8e3fbc"><span class="section-number-3">5.2</span> std::future&lt;&gt; &amp; std::async</h3>
<div class="outline-text-3" id="text-5-2">
<p>
only moveable, wrapped by unique_ptr
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">future</span>&lt;data&gt; <span style="color: #715ab1;">result</span> = <span style="color: #4e3163;">std</span>::async(find_the_answer);
do_other_things();
<span style="color: #4e3163;">std</span>::cout &lt;&lt; result.get() &lt;&lt; <span style="color: #2d9574;">"\n"</span>;
</pre>
</div>
<p>
options: std::launch::async, std::launch::deferred
</p>
</div>

<div id="outline-container-org1aa378d" class="outline-4">
<h4 id="org1aa378d"><span class="section-number-4">5.2.1</span> std::shared_future</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
copyable, wrapped by shared_ptr
</p>
<ul class="org-ul">
<li>operations on copied shared_future are thread-safe</li>
<li>std::future -&gt; std::shared_future</li>
<li>access to the same shared state from multiple threads is safe if each thread does it through its own <b>copy</b> of a <code>shared_future</code> object.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf28beeb" class="outline-3">
<h3 id="orgf28beeb"><span class="section-number-3">5.3</span> std::packaged_task&lt;&gt;</h3>
<div class="outline-text-3" id="text-5-3">
<p>
std::packaged_task&lt;&gt; ties a future to a function or callable object.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">packaged_task</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>(<span style="color: #ba2f59; font-weight: bold;">int</span>, <span style="color: #ba2f59; font-weight: bold;">int</span>)&gt; <span style="color: #6c3163; font-weight: bold;">some_task</span>(task_func);
<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">result</span> = some_task.get_future();
<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">thread</span> <span style="color: #715ab1;">t</span>{<span style="color: #4e3163;">std</span>::move(some_task), a, b};
result.get();
t.join();
</pre>
</div>
</div>

<div id="outline-container-orga8da65a" class="outline-4">
<h4 id="orga8da65a"><span class="section-number-4">5.3.1</span> when to use</h4>
<div class="outline-text-4" id="text-5-3-1">
<ul class="org-ul">
<li>used as a building block for thread pools</li>
<li>task management schemes</li>
</ul>
</div>
</div>

<div id="outline-container-org2a56608" class="outline-4">
<h4 id="org2a56608"><span class="section-number-4">5.3.2</span> specialization of std::packaged_task&lt;&gt;</h4>
<div class="outline-text-4" id="text-5-3-2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">template</span> &lt;&gt; <span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">packaged_task</span>&lt;<span style="color: #4e3163;">std</span>::string(<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">vector</span>&lt;<span style="color: #ba2f59; font-weight: bold;">char</span>&gt; *, <span style="color: #ba2f59; font-weight: bold;">int</span>)&gt; {
<span style="color: #3a81c3; font-weight: bold;">public</span>:
  <span style="color: #3a81c3; font-weight: bold;">template</span> &lt;<span style="color: #3a81c3; font-weight: bold;">typename</span> <span style="color: #ba2f59; font-weight: bold;">Callable</span>&gt; <span style="color: #3a81c3; font-weight: bold;">explicit</span> <span style="color: #6c3163; font-weight: bold;">packaged_task</span>(<span style="color: #ba2f59; font-weight: bold;">Callable</span> &amp;&amp;<span style="color: #715ab1;">f</span>);
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">future</span>&lt;<span style="color: #4e3163;">std</span>::string&gt; <span style="color: #6c3163; font-weight: bold;">get_future</span>();
  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #3a81c3; font-weight: bold;">operator</span><span style="color: #6c3163; font-weight: bold;">()</span>(<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">vector</span>&lt;<span style="color: #ba2f59; font-weight: bold;">char</span>&gt; *, <span style="color: #ba2f59; font-weight: bold;">int</span>);
};
</pre>
</div>
</div>
</div>
</div>
