org/cpp/cppconcurrency.org
** std::promise<>
   - std::promise<> stores a return value or exception
   std::promise<T> provides a means of setting a value (of type T), which can later be read through an associated std::future<T> object.
   The waiting thread could block on the future, while the thread providing the data could use the promise half of the pairing to set
   the associated value and make the future ready.
   #+BEGIN_SRC cpp
     void do_work(std::promise<int> promise) {
       prepare_data();
       promise.set_value(42);
     }

     void do_work(std::promise<void> barrier) {
       std::this_thread::sleep_for(std::chrono::seconds(1));
       barrier.set_value();
     }

     int main() {
       std::promise<int> promise;
       std::future<int> future = promise.get_future();
       std::thread worker(do_work, std::move(promise));
       future.wait();
       std::cout << future.get() << "\n";
       worker.join();

       // Demonstrate using promise<void> to signal state between threads.
       std::promise<void> barrier;
       std::future<void> barrier_future = barrier.get_future();
       std::thread new_work_thread(do_work, std::move(barrier));
       barrier_future.wait();
       new_work_thread.join();
       return 0;
     }
   #+END_SRC
*** set_exception()
    #+BEGIN_SRC cpp
      try {
        some_promise.set_value(calculate_value());
      } catch (...) {
        some_promise.set_exception(std::copy_exception(std::logic_error("foo")));
        //alternative some_promise.set_exception(std::current_exception());
      }
    #+END_SRC
    - std::current_exception()
    - prefer the ~copy_exception~ way: Not only does it simplify the code, but it also provides the compiler with greater opportunity to optimize the code.
    - a call to get() rethrows that stored exception

* Memory Model
** Modification Orders
   Every object in a C++ program has a *defined* modification order composed of all the writes to that object from all threads in the program

** Atomic Types
   An atomic operation is an indivisible operation. You can't observe such an operation half-done from any thread in the system; it's either done or not done.
   - If you do use atomic operations, the *compiler* is responsible for ensuring that the necessary synchronization is in place.

*** Operations
   - ~is_lock_free()~: allows the user to determine whether operations on a given type are done directly with atomic instructions
   - ~load()~
   - ~store()~
   - ~exchange()~
   - ~compare_exchange_weak()~
   - ~compare_exchange_strong()~
   - ~=, +=, *=, |=, --, ++~, or ~fetch_add(), fetch_or()~ etc.

   Each of the operations on the atomic types has an optional memory-ordering argument.

   - The default ordering for all operations is /memory_order_seq_cst/.
**** Store Operations
     which can have /memory_order_relaxed/, /memory_order_release/, or /memory_order_seq_cst/ ordering.
**** Load Operations
     which can have /memory_order_relaxed/, /memory_order_consume/, /memory_order_acquire/, or
     /memory_order_seq_cst/ ordering
**** Read-modify-write Operations
     which can have memory_order_relaxed, memory_order_consume, memory_order_acquire,
     memory_order_release, memory_order_acq_rel, or memory_order_seq_cst ordering

*** ~std::atomic_flag~
    - the *simplest* standard atomic type, which represents a Boolean flag
    - two states: /set/ or /clear/
    #+BEGIN_SRC cpp
      std::atomic_flag f = ATOMIC_FLAG_INIT; // clear state
      f.clear(std::memory_order_release); // store operation
      bool x = f.test_and_set(); // read-modify-write operation
    #+END_SRC

**** simple spinlock_mutex
     #+BEGIN_SRC cpp
       class spinlock_mutex {
         std::atomic_flag flag;

       public:
         spinlock_mutex : flag(ATOMIC_FLAG_INIT) {}

         void lock() {
           while (flag.test_and_set(std::memory_order_acquire))
             ;
         }

         void unlock() { flag.clear(std::memory_order_release); }
       };
     #+END_SRC

*** ~std::atomic<bool>~
    #+BEGIN_SRC cpp
      std::atomic<bool> b;
      bool x = b.load(std::memory_order_acquire);
      b.store(true);
      x = b.exchange(false, std::memory_order_acq_rel);
    #+END_SRC
    - ~std::atomic<bool>~ may not be lock-free

