cpp/cppconcurrency.html

<div id="outline-container-org60f8e61" class="outline-3">
<h3 id="org60f8e61"><span class="section-number-3">5.4</span> std::promise&lt;&gt;</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>std::promise&lt;&gt; stores a return value or exception</li>
</ul>
<p>
std::promise&lt;T&gt; provides a means of setting a value (of type T), which can later be read through an associated std::future&lt;T&gt; object.
The waiting thread could block on the future, while the thread providing the data could use the promise half of the pairing to set
the associated value and make the future ready.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">do_work</span>(<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">promise</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #715ab1;">promise</span>) {
  prepare_data();
  promise.set_value(42);
}

<span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">do_work</span>(<span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">promise</span>&lt;<span style="color: #ba2f59; font-weight: bold;">void</span>&gt; <span style="color: #715ab1;">barrier</span>) {
  <span style="color: #4e3163;">std</span>::<span style="color: #4e3163;">this_thread</span>::sleep_for(<span style="color: #4e3163;">std</span>::<span style="color: #4e3163;">chrono</span>::seconds(1));
  barrier.set_value();
}

<span style="color: #ba2f59; font-weight: bold;">int</span> <span style="color: #6c3163; font-weight: bold;">main</span>() {
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">promise</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #715ab1;">promise</span>;
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">future</span>&lt;<span style="color: #ba2f59; font-weight: bold;">int</span>&gt; <span style="color: #715ab1;">future</span> = promise.get_future();
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">thread</span> <span style="color: #715ab1;">worker</span>(do_work, <span style="color: #4e3163;">std</span>::move(promise));
  future.wait();
  <span style="color: #4e3163;">std</span>::cout &lt;&lt; future.get() &lt;&lt; <span style="color: #2d9574;">"\n"</span>;
  worker.join();

  <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Demonstrate using promise&lt;void&gt; to signal state between threads.</span>
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">promise</span>&lt;<span style="color: #ba2f59; font-weight: bold;">void</span>&gt; <span style="color: #715ab1;">barrier</span>;
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">future</span>&lt;<span style="color: #ba2f59; font-weight: bold;">void</span>&gt; <span style="color: #715ab1;">barrier_future</span> = barrier.get_future();
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">thread</span> <span style="color: #715ab1;">new_work_thread</span>(do_work, <span style="color: #4e3163;">std</span>::move(barrier));
  barrier_future.wait();
  new_work_thread.join();
  <span style="color: #3a81c3; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
<div id="outline-container-orgdc71ca4" class="outline-4">
<h4 id="orgdc71ca4"><span class="section-number-4">5.4.1</span> set_exception()</h4>
<div class="outline-text-4" id="text-5-4-1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">try</span> {
  some_promise.set_value(calculate_value());
} <span style="color: #3a81c3; font-weight: bold;">catch</span> (...) {
  some_promise.set_exception(<span style="color: #4e3163;">std</span>::copy_exception(<span style="color: #4e3163;">std</span>::logic_error(<span style="color: #2d9574;">"foo"</span>)));
  <span style="color: #2aa1ae; background-color: #ecf3ec;">//</span><span style="color: #2aa1ae; background-color: #ecf3ec;">alternative some_promise.set_exception(std::current_exception());</span>
}
</pre>
</div>
<ul class="org-ul">
<li>std::current_exception()</li>
<li>prefer the <code>copy_exception</code> way: Not only does it simplify the code, but it also provides the compiler with greater opportunity to optimize the code.</li>
<li>a call to get() rethrows that stored exception</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orge213ffc" class="outline-2">
<h2 id="orge213ffc"><span class="section-number-2">6</span> Memory Model</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgcc0a6d4" class="outline-3">
<h3 id="orgcc0a6d4"><span class="section-number-3">6.1</span> Modification Orders</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Every object in a C++ program has a <b>defined</b> modification order composed of all the writes to that object from all threads in the program
</p>
</div>
</div>

<div id="outline-container-org6ffc5f5" class="outline-3">
<h3 id="org6ffc5f5"><span class="section-number-3">6.2</span> Atomic Types</h3>
<div class="outline-text-3" id="text-6-2">
<p>
An atomic operation is an indivisible operation. You can't observe such an operation half-done from any thread in the system; it's either done or not done.
</p>
<ul class="org-ul">
<li>If you do use atomic operations, the <b>compiler</b> is responsible for ensuring that the necessary synchronization is in place.</li>
</ul>
</div>

<div id="outline-container-orge41b4d4" class="outline-4">
<h4 id="orge41b4d4"><span class="section-number-4">6.2.1</span> Operations</h4>
<div class="outline-text-4" id="text-6-2-1">
<ul class="org-ul">
<li><code>is_lock_free()</code>: allows the user to determine whether operations on a given type are done directly with atomic instructions</li>
<li><code>load()</code></li>
<li><code>store()</code></li>
<li><code>exchange()</code></li>
<li><code>compare_exchange_weak()</code></li>
<li><code>compare_exchange_strong()</code></li>
<li><code>=, +=, *=, |=, --, ++</code>, or <code>fetch_add(), fetch_or()</code> etc.</li>
</ul>

<p>
Each of the operations on the atomic types has an optional memory-ordering argument.
</p>

<ul class="org-ul">
<li>The default ordering for all operations is <i>memory_order_seq_cst</i>.</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org2ad8e37"></a>Store Operations<br />
<div class="outline-text-5" id="text-org2ad8e37">
<p>
which can have <i>memory_order_relaxed</i>, <i>memory_order_release</i>, or <i>memory_order_seq_cst</i> ordering.
</p>
</div>
</li>
<li><a id="orgafbf234"></a>Load Operations<br />
<div class="outline-text-5" id="text-orgafbf234">
<p>
which can have <i>memory_order_relaxed</i>, <i>memory_order_consume</i>, <i>memory_order_acquire</i>, or
<i>memory_order_seq_cst</i> ordering
</p>
</div>
</li>
<li><a id="org451ff66"></a>Read-modify-write Operations<br />
<div class="outline-text-5" id="text-org451ff66">
<p>
which can have memory_order_relaxed, memory_order_consume, memory_order_acquire,
memory_order_release, memory_order_acq_rel, or memory_order_seq_cst ordering
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org6957b6c" class="outline-4">
<h4 id="org6957b6c"><span class="section-number-4">6.2.2</span> <code>std::atomic_flag</code></h4>
<div class="outline-text-4" id="text-6-2-2">
<ul class="org-ul">
<li>the <b>simplest</b> standard atomic type, which represents a Boolean flag</li>
<li>two states: <i>set</i> or <i>clear</i></li>
</ul>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">atomic_flag</span> <span style="color: #715ab1;">f</span> = ATOMIC_FLAG_INIT; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">clear state</span>
f.clear(<span style="color: #4e3163;">std</span>::memory_order_release); <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">store operation</span>
<span style="color: #ba2f59; font-weight: bold;">bool</span> <span style="color: #715ab1;">x</span> = f.test_and_set(); <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">read-modify-write operation</span>
</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="org66de86d"></a>simple spinlock_mutex<br />
<div class="outline-text-5" id="text-org66de86d">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">spinlock_mutex</span> {
  <span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">atomic_flag</span> <span style="color: #715ab1;">flag</span>;

<span style="color: #3a81c3; font-weight: bold;">public</span>:
  <span style="color: #4e3163;">spinlock_mutex</span> : <span style="color: #6c3163; font-weight: bold;">flag</span>(ATOMIC_FLAG_INIT) {}

  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">lock</span>() {
    <span style="color: #3a81c3; font-weight: bold;">while</span> (flag.test_and_set(<span style="color: #4e3163;">std</span>::memory_order_acquire))
      ;
  }

  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">unlock</span>() { flag.clear(<span style="color: #4e3163;">std</span>::memory_order_release); }
};
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgd7fca4e" class="outline-4">
<h4 id="orgd7fca4e"><span class="section-number-4">6.2.3</span> <code>std::atomic&lt;bool&gt;</code></h4>
<div class="outline-text-4" id="text-6-2-3">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #4e3163;">std</span>::<span style="color: #ba2f59; font-weight: bold;">atomic</span>&lt;<span style="color: #ba2f59; font-weight: bold;">bool</span>&gt; <span style="color: #715ab1;">b</span>;
<span style="color: #ba2f59; font-weight: bold;">bool</span> <span style="color: #715ab1;">x</span> = b.load(<span style="color: #4e3163;">std</span>::memory_order_acquire);
b.store(<span style="color: #4e3163;">true</span>);
x = b.exchange(<span style="color: #4e3163;">false</span>, <span style="color: #4e3163;">std</span>::memory_order_acq_rel);
</pre>
</div>
<ul class="org-ul">
<li><code>std::atomic&lt;bool&gt;</code> may not be lock-free</li>
</ul>
</div>
</div>
