org/cpp/cppconcurrency.org
*** *compare/exchange* operation(RMW)
     - stores the *desired value* if *expected value* is equal to atomic variable
     - the *expected value* is *updated* with atomic variable if they aren't equal
     - return true if the store was performed
     - underlying is a CAS(compare-and-swap) instruction if the processor have one
     - some platform support a double-word-compare-and-swap (DWCAS) instruction
**** ~compare_exchange_weak()~
     The store might not be successful even if the original value was equal to the expected value,
     in which case the value of the variable is unchanged and the return value of ~compare_exchange_weak()~
     is false. This is due to *spurious failure* on some platforms where a sequence of instructions are used
     to implement a single CAS instruction.
     #+BEGIN_SRC cpp
       bool expected{false};
       extern atomic<bool> b; // set somewhere else
       while (!b.compare_exchange_weak(expected, true) && !expected)
         ;
     #+END_SRC
     - Why is ~!expected in~ the example
       #+BEGIN_QUOTE
       It depends on the situation and its desired semantics, but usually it is not needed for correctness.
       Omitting it would yield a very similar semantics. Only in a case where another thread might reset the value to false,
       the semantics could become slightly different (yet I cannot find a meaningful example where you would want that). See
       Tony D.'s comment for a detailed explanation. It is simply a fast track when another thread writes true: Then the we
       abort instead of trying to write true again.
       #+END_QUOTE

**** ~compare_exchange_strong()~
     ~compare_exchange_strong()~ is guaranteed to return false only if the actual value wasn't equal to the expected value.

**** weak or strong
     If the calculation of the value to be stored is simple, it may be beneficial to use ~compare_exchange_weak()~
     in order to avoid a double loop on platforms where ~compare_exchange_weak()~ can fail spuriously (and so
     ~compare_exchange_strong()~ contains a loop). On the other hand, if the calculation of the value to be stored is
     itself time consuming, it may make sense to use ~compare_exchange_strong()~ to avoid having to recalculate the value
     to store when the expected value hasn't changed.
     - hints:
       #+BEGIN_QUOTE
       When a compare-and-exchange is in a loop, the weak version will yield better performance on some platforms. When a
       weak compare-and-exchange would require a loop and a strong one would not, the strong one is preferable.
       #+END_QUOTE

**** memory-ordering semantics
     - one for success
     - another for failure
     - if you don't specify an ordering for failure, it's assumed to be the same as that for success

*** atomic<UDT>
    The type must not have any virtual functions or virtual base classes and must use the
    compiler-generated copy-assignment operator. This essentially permits the compiler to
    use ~memcpy()~ and ~memcmp()~.
    - In general, the compiler will use an *internal lock* for all the operations

*** std::shared_ptr<>
    - atomic operations available for ~shared_ptr~ are /load, store, exchange, and compare/exchange/

* Useful tools
  - std::ref
  - std::distance(iter1, iter2)
  - std::advance(iter, distance)
  - list::splice:
  - std::partition
  - std::ostream_iterator
** std::mem_fn
   useful for std algorithms
   #+BEGIN_SRC cpp
     class SomeClass {
       void some_func() {}
     };

     auto some_func = std::mem_fn(&SomeClass::some_func);
     SomeClass s;
     some_func(s);
     std::some_algo(iter1, iter2, some_func);
   #+END_SRC

** Time Facilities
*** Clocks
**** now
     #+BEGIN_SRC cpp
       auto time_point = std::chrono::some_clock::now();
     #+END_SRC

**** tick period
     - std::ratio<1, 25> ticks every 1/25 seconds
     - std::ratio<5, 2> ticks every 2.5 seconds

     There's *no guarantee* that the observed tick period in a given run of the program matches the specified period for that clock.

**** steady_clock
     If a clock ticks at a uniform rate and can't be adjusted, the clock is said to be a steady clock.
     Steady clocks are important for *timeout calculations*.(system_clock can be changed)

**** high
     /high_resolution_clock/ provides the smallest possible tick period of all the library-supplied clocks.

*** Durations
    std::duration<representation, std::ratio<>>
    - example millisecond duration: std::chrono::duration<double, std::ratio<1,1000>>
    - std::chrono::duration_cast<>: floor(high_resolution)

    The time for a duration-based wait is measured using a steady clock internal to the library, even if the system clock was adjusted during the wait

*** Time points
    std::chrono::time_point<clock, duration>
    - time_since_epoch() returns a duration value specifying the length of time since the clock epoch to that particular time point

*** wait_for & wait_until
    - Clock adjustments are taken into account by the /wait_until/
