cpp/cppconcurrency.html

<div id="outline-container-org4d36f3a" class="outline-4">
<h4 id="org4d36f3a"><span class="section-number-4">6.2.4</span> <b>compare/exchange</b> operation(RMW)</h4>
<div class="outline-text-4" id="text-6-2-4">
<ul class="org-ul">
<li>stores the <b>desired value</b> if <b>expected value</b> is equal to atomic variable</li>
<li>the <b>expected value</b> is <b>updated</b> with atomic variable if they aren't equal</li>
<li>return true if the store was performed</li>
<li>underlying is a CAS(compare-and-swap) instruction if the processor have one</li>
<li>some platform support a double-word-compare-and-swap (DWCAS) instruction</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org3f961cb"></a><code>compare_exchange_weak()</code><br />
<div class="outline-text-5" id="text-org3f961cb">
<p>
The store might not be successful even if the original value was equal to the expected value,
in which case the value of the variable is unchanged and the return value of <code>compare_exchange_weak()</code>
is false. This is due to <b>spurious failure</b> on some platforms where a sequence of instructions are used
to implement a single CAS instruction.
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ba2f59; font-weight: bold;">bool</span> <span style="color: #715ab1;">expected</span>{<span style="color: #4e3163;">false</span>};
<span style="color: #3a81c3; font-weight: bold;">extern</span> <span style="color: #ba2f59; font-weight: bold;">atomic</span>&lt;<span style="color: #ba2f59; font-weight: bold;">bool</span>&gt; <span style="color: #715ab1;">b</span>; <span style="color: #2aa1ae; background-color: #ecf3ec;">// </span><span style="color: #2aa1ae; background-color: #ecf3ec;">set somewhere else</span>
<span style="color: #3a81c3; font-weight: bold;">while</span> (<span style="color: #4e3163;">!</span>b.compare_exchange_weak(expected, <span style="color: #4e3163;">true</span>) &amp;&amp; <span style="color: #4e3163;">!</span>expected)
  ;
</pre>
</div>
<ul class="org-ul">
<li><p>
Why is <code>!expected in</code> the example
</p>
<blockquote>
<p>
It depends on the situation and its desired semantics, but usually it is not needed for correctness.
Omitting it would yield a very similar semantics. Only in a case where another thread might reset the value to false,
the semantics could become slightly different (yet I cannot find a meaningful example where you would want that). See
Tony D.'s comment for a detailed explanation. It is simply a fast track when another thread writes true: Then the we
abort instead of trying to write true again.
</p>
</blockquote></li>
</ul>
</div>
</li>

<li><a id="orgfac460a"></a><code>compare_exchange_strong()</code><br />
<div class="outline-text-5" id="text-orgfac460a">
<p>
<code>compare_exchange_strong()</code> is guaranteed to return false only if the actual value wasn't equal to the expected value.
</p>
</div>
</li>

<li><a id="org2afef56"></a>weak or strong<br />
<div class="outline-text-5" id="text-org2afef56">
<p>
If the calculation of the value to be stored is simple, it may be beneficial to use <code>compare_exchange_weak()</code>
in order to avoid a double loop on platforms where <code>compare_exchange_weak()</code> can fail spuriously (and so
<code>compare_exchange_strong()</code> contains a loop). On the other hand, if the calculation of the value to be stored is
itself time consuming, it may make sense to use <code>compare_exchange_strong()</code> to avoid having to recalculate the value
to store when the expected value hasn't changed.
</p>
<ul class="org-ul">
<li><p>
hints:
</p>
<blockquote>
<p>
When a compare-and-exchange is in a loop, the weak version will yield better performance on some platforms. When a
weak compare-and-exchange would require a loop and a strong one would not, the strong one is preferable.
</p>
</blockquote></li>
</ul>
</div>
</li>

<li><a id="org80cfc75"></a>memory-ordering semantics<br />
<div class="outline-text-5" id="text-org80cfc75">
<ul class="org-ul">
<li>one for success</li>
<li>another for failure</li>
<li>if you don't specify an ordering for failure, it's assumed to be the same as that for success</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgc7f78d5" class="outline-4">
<h4 id="orgc7f78d5"><span class="section-number-4">6.2.5</span> atomic&lt;UDT&gt;</h4>
<div class="outline-text-4" id="text-6-2-5">
<p>
The type must not have any virtual functions or virtual base classes and must use the
compiler-generated copy-assignment operator. This essentially permits the compiler to
use <code>memcpy()</code> and <code>memcmp()</code>.
</p>
<ul class="org-ul">
<li>In general, the compiler will use an <b>internal lock</b> for all the operations</li>
</ul>
</div>
</div>

<div id="outline-container-orgc6f963a" class="outline-4">
<h4 id="orgc6f963a"><span class="section-number-4">6.2.6</span> std::shared_ptr&lt;&gt;</h4>
<div class="outline-text-4" id="text-6-2-6">
<ul class="org-ul">
<li>atomic operations available for <code>shared_ptr</code> are <i>load, store, exchange, and compare/exchange</i></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orga7cd378" class="outline-2">
<h2 id="orga7cd378"><span class="section-number-2">7</span> Useful tools</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>std::ref</li>
<li>std::distance(iter1, iter2)</li>
<li>std::advance(iter, distance)</li>
<li>list::splice:</li>
<li>std::partition</li>
<li>std::ostream_iterator</li>
</ul>
</div>
<div id="outline-container-org6c7f473" class="outline-3">
<h3 id="org6c7f473"><span class="section-number-3">7.1</span> std::mem_fn</h3>
<div class="outline-text-3" id="text-7-1">
<p>
useful for std algorithms
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">class</span> <span style="color: #ba2f59; font-weight: bold;">SomeClass</span> {
  <span style="color: #ba2f59; font-weight: bold;">void</span> <span style="color: #6c3163; font-weight: bold;">some_func</span>() {}
};

<span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">some_func</span> = <span style="color: #4e3163;">std</span>::mem_fn(&amp;<span style="color: #4e3163;">SomeClass</span>::some_func);
<span style="color: #ba2f59; font-weight: bold;">SomeClass</span> <span style="color: #715ab1;">s</span>;
some_func(s);
<span style="color: #4e3163;">std</span>::some_algo(iter1, iter2, some_func);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaaf0322" class="outline-3">
<h3 id="orgaaf0322"><span class="section-number-3">7.2</span> Time Facilities</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-org583e1a5" class="outline-4">
<h4 id="org583e1a5"><span class="section-number-4">7.2.1</span> Clocks</h4>
<div class="outline-text-4" id="text-7-2-1">
</div>
<ul class="org-ul">
<li><a id="org297a22e"></a>now<br />
<div class="outline-text-5" id="text-org297a22e">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #3a81c3; font-weight: bold;">auto</span> <span style="color: #715ab1;">time_point</span> = <span style="color: #4e3163;">std</span>::<span style="color: #4e3163;">chrono</span>::<span style="color: #4e3163;">some_clock</span>::now();
</pre>
</div>
</div>
</li>

<li><a id="orgef4eb98"></a>tick period<br />
<div class="outline-text-5" id="text-orgef4eb98">
<ul class="org-ul">
<li>std::ratio&lt;1, 25&gt; ticks every 1/25 seconds</li>
<li>std::ratio&lt;5, 2&gt; ticks every 2.5 seconds</li>
</ul>

<p>
There's <b>no guarantee</b> that the observed tick period in a given run of the program matches the specified period for that clock.
</p>
</div>
</li>

<li><a id="orgde420b8"></a>steady_clock<br />
<div class="outline-text-5" id="text-orgde420b8">
<p>
If a clock ticks at a uniform rate and can't be adjusted, the clock is said to be a steady clock.
Steady clocks are important for <b>timeout calculations</b>.(system_clock can be changed)
</p>
</div>
</li>

<li><a id="org4b80613"></a>high<br />
<div class="outline-text-5" id="text-org4b80613">
<p>
<i>high_resolution_clock</i> provides the smallest possible tick period of all the library-supplied clocks.
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org229e36f" class="outline-4">
<h4 id="org229e36f"><span class="section-number-4">7.2.2</span> Durations</h4>
<div class="outline-text-4" id="text-7-2-2">
<p>
std::duration&lt;representation, std::ratio&lt;&gt;&gt;
</p>
<ul class="org-ul">
<li>example millisecond duration: std::chrono::duration&lt;double, std::ratio&lt;1,1000&gt;&gt;</li>
<li>std::chrono::duration_cast&lt;&gt;: floor(high_resolution)</li>
</ul>

<p>
The time for a duration-based wait is measured using a steady clock internal to the library, even if the system clock was adjusted during the wait
</p>
</div>
</div>

<div id="outline-container-org1e1ad38" class="outline-4">
<h4 id="org1e1ad38"><span class="section-number-4">7.2.3</span> Time points</h4>
<div class="outline-text-4" id="text-7-2-3">
<p>
std::chrono::time_point&lt;clock, duration&gt;
</p>
<ul class="org-ul">
<li>time_since_epoch() returns a duration value specifying the length of time since the clock epoch to that particular time point</li>
</ul>
</div>
</div>

<div id="outline-container-org494487b" class="outline-4">
<h4 id="org494487b"><span class="section-number-4">7.2.4</span> wait_for &amp; wait_until</h4>
<div class="outline-text-4" id="text-7-2-4">
<ul class="org-ul">
<li>Clock adjustments are taken into account by the <i>wait_until</i></li>
</ul>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
